Autodesk.Revit.UI.ExternalDataManagerDataItemId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ExternalDataManagerDataItemId.Id
The identity of the data item.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItemId.#ctor(System.Int64)
Constructor
id:
The identity of the data item.
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItemId.#ctor(Autodesk.Revit.UI.ExternalDataManagerDataItemId)
Create a copy of the object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.ExternalDataManagerDataItemId
Unique identifier of an external data manager data item.
Remarks:
Each external data manager data item must have a unique 64-bit integer ID.
Unique ID should be created using appropriate generation mechanism.
Since:
2027